## pandas
데이터 분석을 위한 파이썬 철저 입문 교재 예재파일

### 구조적 데이터 생성하기

#### Series를 활용한 데이터 생성

**[11장: 237페이지]**

In [164]:
import pandas as pd

**[11장: 238페이지]**

In [165]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

**[11장: 238페이지]**

In [166]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

**[11장: 239페이지]**

In [167]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

**[11장: 239페이지]**

In [168]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

**[11장: 239페이지]**

In [169]:
import numpy as np

s3 = pd.Series([np.nan,10,30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

**[11장: 240페이지]**

In [170]:
index_date = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

**[11장: 241페이지]**

In [171]:
# dict를 사용하면 key 값이 index, value 값이 value 가 된다.
s5 = pd.Series({'국어': 100, '영어': 95, '수학': 90})
s5

국어    100
영어     95
수학     90
dtype: int64

#### 날짜 자동 생성: date_range

**[11장: 241페이지]**

In [172]:
import pandas as pd

# 
pd.date_range(start='2019-01-01',end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

**[11장: 242페이지]**

In [173]:
pd.date_range(start='2019/01/01',end='2019.01.07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [174]:
pd.date_range(start='01-01-2019',end='01/07/2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [175]:
pd.date_range(start='2019-01-01',end='01.07.2019')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

**[11장: 242페이지]**

In [176]:
pd.date_range(start='2019-01-01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

**[11장: 243페이지]**

In [177]:
pd.date_range(start='2019-01-01', periods = 4, freq = '2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

**[11장: 244페이지]**

In [178]:
pd.date_range(start='2019-01-01', periods = 4, freq = 'W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

**[11장: 244페이지]**

In [179]:
pd.date_range(start='2019-01-01', periods = 12, freq = '2BM')

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31',
               '2020-05-29', '2020-07-31', '2020-09-30', '2020-11-30'],
              dtype='datetime64[ns]', freq='2BM')

**[11장: 244페이지]**

In [180]:
pd.date_range(start='2019-01-01', periods = 4, freq = 'QS')

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

**[11장: 244페이지]**

In [181]:
pd.date_range(start='2019-01-01', periods = 3, freq = 'AS')

DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

**[11장: 244페이지]**

In [182]:
pd.date_range(start = '2019-01-01 08:00', periods = 10, freq='H')

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

**[11장: 245페이지]**

In [183]:
pd.date_range(start = '2019-01-01 08:00', periods = 10, freq='BH')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

**[11장: 245페이지]**

In [184]:
pd.date_range(start = '2019-01-01 10:00', periods = 4, freq='30min')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

**[11장: 245페이지]**

In [185]:
pd.date_range(start = '2019-01-01 10:00', periods = 4, freq='30T')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

**[11장: 246페이지]**

In [186]:
pd.date_range(start = '2019-01-01 10:00:00', periods = 4, freq='10S')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:00:10',
               '2019-01-01 10:00:20', '2019-01-01 10:00:30'],
              dtype='datetime64[ns]', freq='10S')

**[11장: 246페이지]**

In [187]:
index_date = pd.date_range(start = '2019-03-01', periods = 5, freq='D')
pd.Series([51, 62, 55, 49, 58], index = index_date )

2019-03-01    51
2019-03-02    62
2019-03-03    55
2019-03-04    49
2019-03-05    58
Freq: D, dtype: int64

#### DataFrame을 활용한 데이터 생성

**[11장: 247페이지]**

In [188]:
import pandas as pd

pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

**[11장: 248페이지]**

In [189]:
import numpy as np
import pandas as pd

data_list = np.array([[10, 20, 30], [40, 50, 60], [70, 80, 90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

**[11장: 248페이지]**

In [190]:
import numpy as np
import pandas as pd

data = np.array([[1, 2, 3], [4, 5, 6], [7, 8 ,9], [10, 11, 12]])
index_date = pd.date_range('2019-09-01', periods=4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index=index_date, columns=columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

**[11장: 249페이지]**

In [191]:
table_data = {'연도': [2015, 2016, 2016, 2017, 2017],
              '지사': ['한국', '한국', '미국', '한국','미국'],
              '고객 수': [200, 250, 450, 300, 500]}
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

**[11장: 249페이지]**

In [192]:
# dict를 사용하면 key는 column이 되고 value값은 그대로 value 값으로 입력이 된다.
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

**[11장: 250페이지]**

In [193]:
df = pd.DataFrame(table_data, columns=['연도', '지사', '고객수'])
df

     연도  지사  고객수
0  2015  한국  NaN
1  2016  한국  NaN
2  2016  미국  NaN
3  2017  한국  NaN
4  2017  미국  NaN

**[11장: 251페이지]**

In [194]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [195]:
df.columns

Index(['연도', '지사', '고객수'], dtype='object')

In [196]:
df.values

array([[2015, '한국', nan],
       [2016, '한국', nan],
       [2016, '미국', nan],
       [2017, '한국', nan],
       [2017, '미국', nan]], dtype=object)

### 데이터 연산

**[11장: 251 ~ 252페이지]**

In [197]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [198]:
s2 - s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [199]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [200]:
s2 / s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

**[11장: 252 ~ 253페이지]**

In [201]:
# numpy 와 다르게 데이터끼리 사이즈가 달라도 연산이 가능하다.
s3 = pd.Series([1, 2, 3, 4])
s4 = pd.Series([10, 20, 30, 40, 50])

# s3 = pd.Series(["1과", "2과", "3", "4"])
# s4 = pd.Series(["10", "20이다", "30", "40", "50"])

s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [202]:
s4 - s3

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [203]:
s3 * s4

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [204]:
s4/s3

0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

**[11장: 253 ~ 254페이지]**

In [205]:
table_data1 = {'A': [1, 2, 3, 4, 5],
              'B': [10, 20, 30, 40, 50],
              'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [206]:
table_data2 = {'A': [6, 7, 8],
              'B': [60, 70, 80],
              'C': [600, 700, 800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

**[11장: 254페이지]**

In [207]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

**[11장: 255페이지]**

In [208]:
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

**[11장: 256페이지]**

In [209]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [210]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

**[11장: 256 ~ 257페이지]**

In [211]:
#axis 값을 1로 하면 행단위로 연산을 할수 있다.
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [212]:
df3.std(axis=1)

2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

**[11장: 257페이지]**

In [213]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

### 데이터를 원하는 대로 선택하기

**[11장: 258페이지]**

In [214]:
import pandas as pd
import numpy as np

KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

**[11장: 259페이지]**

In [215]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [216]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [217]:
df_KTX.values

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

**[11장: 260페이지]**

In [218]:
# DataFrame 데이터의 위에서5개 행의 데이터만 출력해준다
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [219]:
# DataFrame 데이터의 아래에서5개 행의 데이터만 출력해준다
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

**[11장: 260 ~ 261페이지]**

In [220]:
# DataFrame 데이터의 위에서 3개 행의 데이터만 출력해준다
df_KTX.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [221]:
# DataFrame 데이터의 아래에서 2개행의 데이터만 출력해준다
df_KTX.tail(2)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

**[11장: 261페이지]**

In [222]:
df_KTX[1:3]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

**[11장: 261페이지]**

In [223]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

**[11장: 262페이지]**

In [224]:
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

**[11장: 262페이지]**

In [225]:
df_KTX.loc['2013':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

**[11장: 263페이지]**

In [226]:
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

**[11장: 263페이지]**

In [227]:
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

**[11장: 264페이지]**

In [228]:
df_KTX['경부선 KTX'][2:5]

2013    42005
2014    43621
2015    41702
Name: 경부선 KTX, dtype: int64

**[11장: 264페이지]**

In [229]:
df_KTX.loc['2016']['호남선 KTX']

10622.0

In [230]:
df_KTX.loc['2016','호남선 KTX']

10622

In [231]:
df_KTX['호남선 KTX']['2016']

10622

In [232]:
df_KTX['호남선 KTX'][5]

10622

In [233]:
df_KTX['호남선 KTX'].loc['2016']

10622

**[11장: 265페이지]**

In [234]:
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

**[11장: 265페이지]**

In [235]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

**[11장: 266페이지]**

In [236]:
df_KTX[['전라선 KTX', '경전선 KTX', '동해선 KTX', '호남선 KTX', '경부선 KTX']]

      전라선 KTX  경전선 KTX  동해선 KTX  호남선 KTX  경부선 KTX
2011      309     3627      NaN     7313    39060
2012     1771     4168      NaN     6967    39896
2013     1954     4088      NaN     6873    42005
2014     2244     4424      NaN     6626    43621
2015     3146     4606   2395.0     8675    41702
2016     3945     4984   3786.0    10622    41266
2017     5766     5570   6667.0     9228    32427

### 데이터 통합하기

#### 세로 방향으로 통합하기

**[11장: 267페이지]**

In [237]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})
df1

print(pd.__version__)

2.0.1

**[11장: 267페이지]**

In [238]:
df2 = pd.DataFrame({'Class1': [87, 89],
                    'Class2': [85, 90]})
df2

   Class1  Class2
0      87      85
1      89      90

**[11장: 267페이지]**

In [239]:
# pandas 2.0 버전부터 append 함수는 사용하지 않는다.
# concat 함수로 사용하면 됨.
#df1.append(df2)

pd.concat([df1, df2])

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

**[11장: 268페이지]**

In [263]:
#df1.append(df2, ignore_index=True)
pd.concat([df1, df2], ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

**[11장: 268페이지]**

In [241]:
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

   Class1
0      96
1      83

**[11장: 269페이지]**

In [264]:
#df2.append(df3, ignore_index=True)
pd.concat([df2, df3], ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

#### 가로 방향으로 통합하기

**[11장: 269페이지]**

In [243]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

**[11장: 270페이지]**

In [244]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

**[11장: 270페이지]**

In [245]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

**[11장: 270페이지]**

In [246]:
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

   Class4
0      82
1      92

**[11장: 271페이지]**

In [247]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

#### 특정 열을 기준으로 통합하기

**[11장: 271 ~272페이지]**

In [248]:
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [249]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

**[11장: 272페이지]**

In [250]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

**[11장: 273페이지]**

In [251]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [252]:
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

**[11장: 274페이지]**

In [253]:
df_left.merge(df_right, how='left', on = 'key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [254]:
df_left.merge(df_right, how='right', on = 'key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [255]:
# 합집합 개념
df_left.merge(df_right, how='outer', on = 'key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [256]:
# 교집합 개념
df_left.merge(df_right, how='inner', on = 'key')

  key  left  right
0   A     1      4
1   B     2      5

### 데이터 파일을 읽고 쓰기

#### 표 형식의 데이터 파일을 읽기

**[11장: 276페이지]**

In [284]:
%%writefile ./sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

# UsageError: Line magic function `%%writefile` not found.
# 주피터 노트북에서 %%writefile은 cell의 맨 윗줄에서 사용해야 된다.

UsageError: Line magic function `%%writefile` not found.

**[11장: 276페이지]**

In [269]:
import pandas as pd

# pd.read_csv('C:/myPyCode/data/sea_rain1.csv')
pd.read_csv('./sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

**[11장: 277페이지]**

In [ ]:
pd.read_csv('./sea_rain1_from_notepad.csv', encoding = "cp949")

**[11장: 277페이지]**

In [268]:
%%writefile ./sea_rain1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing ./sea_rain1_space.txt

**[11장: 278페이지]**

In [271]:
pd.read_csv('./sea_rain1_space.txt', sep=" ")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

**[11장: 278페이지]**

In [272]:
pd.read_csv('./sea_rain1.csv', index_col="연도" )

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

#### 표 형식의 데이터를 파일로 쓰기

**[11장: 279페이지]**

In [275]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 78],
                      'Height':[165, 177, 160, 182]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      78     182

**[11장: 280페이지]**

In [276]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    23.547881
dtype: float64

**[11장: 280페이지]**

In [277]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      78     182  23.547881

**[11장: 281페이지]**

In [278]:
df_WH.to_csv('./save_DataFrame.csv')

**[11장: 281페이지]**

In [ ]:
!type ./save_DataFrame.csv

**[11장: 281페이지]**

In [280]:
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
                       '판매량':[32, 53, 40, 25]},
                       index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

**[11장: 281페이지]**

In [281]:
file_name = './save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=" ", encoding = "cp949")

**[11장: 282페이지]**

In [ ]:
!type C:/Users/Playdata/Documents/hello_python/Python_Study/pandas/save_DataFrame_cp949.txt

## 11.3 정리